# Pivot tables by categories for analysis

[**See `pivot_table` instructions**](https://datons.craft.me/h3f5pSQSE7l6RW) to complete the following exercises.

## Load dataset

In [1]:
import seaborn as sns

df_titanic = sns.load_dataset('titanic').loc[:,['alive', 'class', 'sex', 'age', 'fare']]
df_titanic['class'] = df_titanic['class'].astype(str)

In [2]:
df_titanic

    alive  class     sex   age     fare
0      no  Third    male  22.0   7.2500
1     yes  First  female  38.0  71.2833
..    ...    ...     ...   ...      ...
889   yes  First    male  26.0  30.0000
890    no  Third    male  32.0   7.7500

[891 rows x 5 columns]

## 1 categorical variable

**Exercise:** Average  `fare` paid by `sex`.

In [3]:
df_titanic.pivot_table(index='sex', values='fare', aggfunc='mean')

             fare
sex
female  44.479818
male    25.523893

---

## 2 categorical variables

**Exercise:** Who paid more, on average, to go on the Titanic based on `class` and `sex`?

In [4]:
df_titanic.pivot_table(index='sex', columns='class', values='fare', aggfunc='mean')

class        First     Second      Third
sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

## 3 categorical variables

**Exercise:** Who paid more, on average, to go on the Titanic based on `class`, `sex` and `alive`?

In [5]:
df_titanic.pivot_table(index=['sex', 'alive'], columns='class', values='fare', aggfunc='mean')

class              First     Second      Third
sex    alive
female no     110.604167  18.250000  19.773093
       yes    105.978159  22.288989  12.464526
male   no      62.894910  19.488965  12.204469
       yes     74.637320  21.095100  15.579696

## Real life applications

- [Which country has more billionaires wealth by industry?](https://datons.ai/style-pandas-pivot-table-to-create-heat-matrix/)
- [Which hour-month generates more electricy in a solar plant?](https://datons.ai/temporal-column-manipulation-with-pandas/)